# Menata ulang penempatan kolom pada Data Frame

## Import Modules

In [1]:
import pandas as pd
import numpy as np

print("Pandas version:", pd.__version__)
print("NumPy version:", np.__version__)

Pandas version: 2.3.1
NumPy version: 2.3.2

## Persiapan Data Frame

In [ ]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(
    np.random.randint(1, 10, size=(n_rows, n_cols)),
    columns=cols)
df

   A  B  C  D  E
0  3  1  5  3  5
1  6  6  5  1  1
2  5  6  1  5  9
3  2  4  8  4  8
4  1  5  4  1  3

## Menata ulang penempatan kolom pada Data Frame

In [3]:
df[['D', 'C', 'A', 'E', 'B']]  # Menata ulang kolom

   D  C  A  E  B
0  3  5  3  5  1
1  1  5  6  1  6
2  5  1  5  9  6
3  4  8  2  8  4
4  1  4  1  3  5

In [4]:
df

   A  B  C  D  E
0  3  1  5  3  5
1  6  6  5  1  1
2  5  6  1  5  9
3  2  4  8  4  8
4  1  5  4  1  3

In [5]:
df = df[['D', 'C', 'A', 'E', 'B']]  # Menata ulang kolom

In [6]:
df

   D  C  A  E  B
0  3  5  3  5  1
1  1  5  6  1  6
2  5  1  5  9  6
3  4  8  2  8  4
4  1  4  1  3  5